## Создание веб сервиса.

### Jetty
В качестве http сервера мы будем использовать jetty.

- connector - принимает http запросы (request)
- handler(s) - непосредственно обрабатывает запросы и возвращает response
- ThreadPool - pool потоков для обработки запросов

*Диаграмма*

Connector
    |
    |
 Server -- ThreadPool
    |
    |
Handler

### Сервлет

Servlet
- наследник некоторого класса, который будет содержать функции предназначенные для обработки запроса. 
- класс, расширяющий возможности сервера.
- как applet, только на web сервере
- java решение для создания динамических страниц
- объект, который обрабатывает http запрос (request) и возвращает ответ (response) - html страницу

ServletContainer
- часть web сервера, содержащая сервлеты 
- связывает URL с сервлетом
- та часть сервера, которая содержит мапинг - документа, котрый пользователь запрашивает на сервлет, который этот документ обрабатывает

### Шаблонизатор <freemaker>
Это библиотеки, позволяющие совместить данные полученные из текстового файла (Template files) и данные полученные динамическим путем (Java objects). Создает страницы для response. 


- 
